def count_letters(text1):
    text = text1.lower()
    count_ = {}
    for n in text:
        if n.isalpha():
            if n in count_:
                count_[n] += 1
            else:
                count_[n] = 1
    return count_

def calculate_frequency(dictionary):
    sum_ = sum(dictionary.values())
    for let in dictionary:
        print(f"{let}: {dictionary[let] / sum_:.2f}")
    return dictionary

main_str = """
У лукоморья дуб зелёный;
Златая цепь на дубе том:
И днём и ночью кот учёный
Всё ходит по цепи кругом;
Идёт направо — песнь заводит,
Налево — сказку говорит.
Там чудеса: там леший бродит,
Русалка на ветвях сидит;
Там на неведомых дорожках
Следы невиданных зверей;
Избушка там на курьих ножках
Стоит без окон, без дверей;
Там лес и дол видений полны;
Там о заре прихлынут волны
На брег песчаный и пустой,
И тридцать витязей прекрасных
Чредой из вод выходят ясных,
И с ними дядька их морской;
Там королевич мимоходом
Пленяет грозного царя;
Там в облаках перед народом
Через леса, через моря
Колдун несёт богатыря;
В темнице там царевна тужит,
А бурый волк ей верно служит;
Там ступа с Бабою Ягой
Идёт, бредёт сама собой,
Там царь Кащей над златом чахнет;
Там русский дух… там Русью пахнет!
И там я был, и мёд я пил;
У моря видел дуб зелёный;
Под ним сидел, и кот учёный
Свои мне сказки говорил.
"""


calculate_frequency(count_letters(main_str))
#нужно распаковать но я хз не получается иначе правильный ответ получить
