numbers = [2, -93, -2, 8, 0, -44, -1, -85, -14, 90, -22, -90, -100, -8, 38, -92, -45, 67, 53, 25]
#поставила 0, чтобы не выдавал ошибку
numbers1 = [2, -93, -2, 8, -44, -1, -85, -14, 90, -22, -90, -100, -8, 38, -92, -45, 67, 53, 25]
# TODO заменить значение пропущенного элемента средним арифметическим

average = sum(numbers1) / len(numbers)
#print(average)

numbers2 = [2, -93, -2, 8, -15.65, -44, -1, -85, -14, 90, -22, -90, -100, -8, 38, -92, -45, 67, 53, 25]
print("Измененный список:", numbers2)
